use std::io::{self,Write};
fn main() {
    
    let mut input = String::new();
    io::stdin().read_line(&mut input).expect("Failed to read line");
    let input: i32 = input.trim().parse().expect("Failed to parse input");
    let mut n = input;
    find_a_factor(n);
}
fn find_a_factor(x:i32){
    let mut nub= x;//เก็บ ค่า เข้ามาเพื่อ เอาไปนับตัวที่เอาไปหารกับจำนวนเฉพาะใน loop ว่าเหลือเท่าไหร่
    let mut str = "".to_string(); //สร้าง string เพื่อเก็บค่า "2*5*7" อะไรประมาณนี้
    let mut stop = true; //มีไว้เพื่อไม่ให้ตรวจสอบทุกตัวใน Array ของจำนวนเฉพาะ วนแค่อันทีหารได้
    //Array ที่เก็บ จำนวนเฉพาะ 1-1000 
    let prime_number = [
        2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53,
        59, 61, 67, 71, 73, 79, 83, 89, 97, 101, 103, 107, 109, 113, 
        127, 131, 137, 139, 149, 151, 157, 163, 167, 173, 179, 181, 
        191, 193, 197, 199, 211, 223, 227, 229, 233, 239, 241, 251, 
        257, 263, 269, 271, 277, 281, 283, 293, 307, 311, 313, 317, 
        331, 337, 347, 349, 353, 359, 367, 373, 379, 383, 389, 397, 
        401, 409, 419, 421, 431, 433, 439, 443, 449, 457, 461, 463, 
        467, 479, 487, 491, 499, 503, 509, 521, 523, 541, 547, 557,
        563, 569, 571, 577, 587, 593, 599, 601, 607, 613, 617, 619, 
        631, 641, 643, 647, 653, 659, 661, 673, 677, 683, 691, 701, 
        709, 719, 727, 733, 739, 743, 751, 757, 761, 769, 773, 787, 
        797, 809, 811, 821, 823, 827, 829, 839, 853, 857, 859, 863, 
        877, 881, 883, 887, 907, 911, 919, 929, 937, 941, 947, 953, 
        967, 971, 977, 983, 991, 997
    ];

    for row in 0..prime_number.len(){ //วน loop ตามจำนวนสมาชิกใน Array prime_number     
        if stop{//ถ้า stop ยัง จริงอยู่ เข้าเงื่อนไข
            while nub%prime_number[row]==0 {//ถ้า nub ม็อด สมาชิกใน prime_number จำนวนเฉพาะ ยังได้ = 0 วนloop whlie ต่อไป
                nub = nub/prime_number[row];//nub หาร สมาชิกใน prime_number จำนวนเฉพาะ
                if nub==1 { //ถ้า nub = 0 เข้าเงื่อนไข
                    stop = false;//ให้ stop เป้น เท็จ เพื่อเตรียมออกจาก loop for ใหญ่
                    str =format!("{}{}",str,prime_number[row]);break;//เก็บค่าSring ของ str ที่ต่อ กันคือ strต่อกับสมาชิกใน prime_number จำนวนเฉพาะ ออกจาก whlie
                }else{//ถ้า nub ไม่เท่า 0
                    str =format!("{}{}{}",str,prime_number[row],"*");//เก็บค่าSring ของ str ที่ต่อ กันคือ strต่อกับสมาชิกใน prime_number จำนวนเฉพาะต่อกับ *
                }
            }
        }else{//จะเกิดเมื่อ stop เป็น เท็จ
            break;//ออกจาก loop for
        }  
    }


    print!("{} = {}",x,str);//ปรี้นค่า x กับ ค่า str
    
//555
}